安全首先有5个基本目标：<br/>
1.数据保密性  只可以被授权方使用<br/><br/>
2.数据完整性  只可以被授权方修改<br/>
3.数据的可用性 数据可以被授权访问<br/>
4.系统的可靠性 确保系统在规定的条件下以及时间内完成规定的功能<br/>
5.数据的抗抵赖性 又称为抗抵赖性，主要是发送方和接收方执行各自的操作后不可任意否认<br/>
以及拓展的4个目标：<br/>
1.可控性 信息以及信息系统可以被监控到<br/>
2.可审查性 主要靠以上抗抵赖性，可控性，对合法 用户，攻击者，破坏者，抵赖者的行为有证据可查<br/>
3.认证 确保数据的接收方和发送方是合法的<br/>
4.访问控制 确保数据不被非授权方或未授权的方式使用<br/>
osi(国际标准化组织定义的：开放式通信系统互联模型)<br/>
它对网络定义了7层，对安全定义了5个服务,又对5个服务定制了8个机制，他们服务和机制分别是:<br/>
1.<br/>
服务:认证服务<br/>
说明:在网络交互中对收发双方的身份以及数据来源进行验证<br/>
机制:<br/>
认证机制：主要作用是辨别数据接收方接的数据是否来自期望的发送方<br/>
       数字签名机制：利用此机制可以用户身份认证和消息认证，它具有解决收发双方纠纷的能力<br/>
常用的算法类型:<br/>
1.非对称加密 如DSA(加密算法使用公开密钥，为接收者验证数据完整性和发送者的身份验证，可也可以由第三方确定去签名和所签数据的真实性),RSA( 作者的名字命名，第一个可用于数据加密以及    签名的算法，他的安全性一直未能得到理论上的证明，他经历了各种攻击至今没有被完全攻破)<br/>
2.<br/>
服务:访问控制服务、<br/>
说明:防止未授权的行为访问资源，包括用户身份确认和用户权限确认<br/>
机制:<br/>
访问控制机制:如:程序上的权限控制,如: BRAC（Base Role Access Control）<br/>
路由控制机制:为数据发送选择安全的网络通信路径，避免发送方使用不安全路径发送数据，提高数据的安全性<br/>
3.<br/>
服务:数据保密性服务<br/>
说明:防止数据在传输过程中泄露<br/>
机制:<br/>
加密机制: 主要使用对称加密算法如:DES(data encryption standard)或非对称加密如：RSA( 作者的名字命名，第一个可用于数据加密以及    签名的算法，他的安全性一直未能得到理论上的证明，他经历了各种攻击至今没有被完全攻破)<br/>
业务流填充机制:y又称为传输流填充机制<br/>